cmsis-svd/cmsis-svd/data/Atmel/ATSAMD51P19A.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FREQM</name>
      <version>1.1.0</version>
      <description>Frequency Meter</description>
      <groupName>FREQM</groupName>
      <prependToName>FREQM_</prependToName>
      <baseAddress>0x40002C00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FREQM</name>
        <value>28</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control A Register</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control B Register</description>
          <addressOffset>0x01</addressOffset>
          <size>8</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>START</name>
              <description>Start Measurement</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGA</name>
          <description>Config A register</description>
          <addressOffset>0x02</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>REFNUM</name>
              <description>Number of Reference Clock Cycles</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear Register</description>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DONE</name>
              <description>Measurement Done Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set Register</description>
          <addressOffset>0x09</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DONE</name>
              <description>Measurement Done Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Register</description>
          <addressOffset>0x0A</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DONE</name>
              <description>Measurement Done</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STATUS</name>
          <description>Status Register</description>
          <addressOffset>0x0B</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>BUSY</name>
              <description>FREQM Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OVF</name>
              <description>Sticky Count Value Overflow</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCBUSY</name>
          <description>Synchronization Busy Register</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>VALUE</name>
          <description>Count Value Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Measurement Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>GCLK</name>
      <version>1.2.0</version>
      <description>Generic Clock Generator</description>
      <groupName>GCLK</groupName>
      <prependToName>GCLK_</prependToName>
      <baseAddress>0x40001C00</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
