cmsis-svd/cmsis-svd/data/Atmel/ATSAMD51P19A.svd
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK8</name>
                  <description>Generic clock generator 8</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK9</name>
                  <description>Generic clock generator 9</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK10</name>
                  <description>Generic clock generator 10</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK11</name>
                  <description>Generic clock generator 11</description>
                  <value>0x800</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GENCTRL8</name>
              <description>Generic Clock Generator Control 8 Synchronization Busy bits</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>GENCTRL8Select</name>
                <enumeratedValue>
                  <name>GCLK0</name>
                  <description>Generic clock generator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK1</name>
                  <description>Generic clock generator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK2</name>
                  <description>Generic clock generator 2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK3</name>
                  <description>Generic clock generator 3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK4</name>
                  <description>Generic clock generator 4</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK5</name>
                  <description>Generic clock generator 5</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK6</name>
                  <description>Generic clock generator 6</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK7</name>
                  <description>Generic clock generator 7</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK8</name>
                  <description>Generic clock generator 8</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK9</name>
                  <description>Generic clock generator 9</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK10</name>
                  <description>Generic clock generator 10</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK11</name>
                  <description>Generic clock generator 11</description>
                  <value>0x800</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GENCTRL9</name>
              <description>Generic Clock Generator Control 9 Synchronization Busy bits</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>GENCTRL9Select</name>
                <enumeratedValue>
                  <name>GCLK0</name>
                  <description>Generic clock generator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK1</name>
                  <description>Generic clock generator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK2</name>
                  <description>Generic clock generator 2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK3</name>
                  <description>Generic clock generator 3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK4</name>
                  <description>Generic clock generator 4</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK5</name>
                  <description>Generic clock generator 5</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK6</name>
                  <description>Generic clock generator 6</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK7</name>
                  <description>Generic clock generator 7</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK8</name>
                  <description>Generic clock generator 8</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK9</name>
                  <description>Generic clock generator 9</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK10</name>
                  <description>Generic clock generator 10</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK11</name>
                  <description>Generic clock generator 11</description>
                  <value>0x800</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GENCTRL10</name>
              <description>Generic Clock Generator Control 10 Synchronization Busy bits</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>GENCTRL10Select</name>
                <enumeratedValue>
                  <name>GCLK0</name>
                  <description>Generic clock generator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK1</name>
                  <description>Generic clock generator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK2</name>
                  <description>Generic clock generator 2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK3</name>
                  <description>Generic clock generator 3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK4</name>
                  <description>Generic clock generator 4</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK5</name>
                  <description>Generic clock generator 5</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK6</name>
                  <description>Generic clock generator 6</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK7</name>
                  <description>Generic clock generator 7</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK8</name>
                  <description>Generic clock generator 8</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK9</name>
                  <description>Generic clock generator 9</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK10</name>
                  <description>Generic clock generator 10</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK11</name>
                  <description>Generic clock generator 11</description>
                  <value>0x800</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GENCTRL11</name>
              <description>Generic Clock Generator Control 11 Synchronization Busy bits</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>GENCTRL11Select</name>
                <enumeratedValue>
                  <name>GCLK0</name>
                  <description>Generic clock generator 0</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK1</name>
                  <description>Generic clock generator 1</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK2</name>
                  <description>Generic clock generator 2</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK3</name>
                  <description>Generic clock generator 3</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK4</name>
                  <description>Generic clock generator 4</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK5</name>
                  <description>Generic clock generator 5</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK6</name>
                  <description>Generic clock generator 6</description>
                  <value>0x40</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK7</name>
                  <description>Generic clock generator 7</description>
                  <value>0x80</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK8</name>
                  <description>Generic clock generator 8</description>
                  <value>0x100</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK9</name>
                  <description>Generic clock generator 9</description>
                  <value>0x200</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK10</name>
                  <description>Generic clock generator 10</description>
                  <value>0x400</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK11</name>
                  <description>Generic clock generator 11</description>
                  <value>0x800</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <dim>12</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>GENCTRL%s</name>
          <description>Generic Clock Generator Control</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SRC</name>
              <description>Source Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>SRCSelect</name>
                <enumeratedValue>
                  <name>XOSC0</name>
                  <description>XOSC0 oscillator output</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOSC1</name>
                  <description>XOSC1 oscillator output</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLKIN</name>
                  <description>Generator input pad</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLKGEN1</name>
                  <description>Generic clock generator 1 output</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OSCULP32K</name>
                  <description>OSCULP32K oscillator output</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOSC32K</name>
                  <description>XOSC32K oscillator output</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DFLL</name>
                  <description>DFLL output</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPLL0</name>
                  <description>DPLL0 output</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DPLL1</name>
                  <description>DPLL1 output</description>
                  <value>0x8</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>GENEN</name>
              <description>Generic Clock Generator Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>IDC</name>
              <description>Improve Duty Cycle</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OOV</name>
              <description>Output Off Value</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>OE</name>
              <description>Output Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIVSEL</name>
              <description>Divide Selection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RUNSTDBY</name>
              <description>Run in Standby</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DIV</name>
              <description>Division Factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>48</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>PCHCTRL%s</name>
          <description>Peripheral Clock Control</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>GEN</name>
              <description>Generic Clock Generator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>GENSelect</name>
                <enumeratedValue>
                  <name>GCLK0</name>
                  <description>Generic clock generator 0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK1</name>
                  <description>Generic clock generator 1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK2</name>
                  <description>Generic clock generator 2</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK3</name>
                  <description>Generic clock generator 3</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK4</name>
                  <description>Generic clock generator 4</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK5</name>
                  <description>Generic clock generator 5</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK6</name>
                  <description>Generic clock generator 6</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK7</name>
                  <description>Generic clock generator 7</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK8</name>
                  <description>Generic clock generator 8</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK9</name>
                  <description>Generic clock generator 9</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK10</name>
                  <description>Generic clock generator 10</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCLK11</name>
                  <description>Generic clock generator 11</description>
                  <value>0xb</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CHEN</name>
              <description>Channel Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WRTLOCK</name>
              <description>Write Lock</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
