cmsis-svd/cmsis-svd/data/Atmel/ATSAMD51P19A.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>NVMCTRL</name>
      <version>1.0.0</version>
      <description>Non-Volatile Memory Controller</description>
      <groupName>NVMCTRL</groupName>
      <prependToName>NVMCTRL_</prependToName>
      <baseAddress>0x41004000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x80</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>NVMCTRL_0</name>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>NVMCTRL_1</name>
        <value>30</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <resetValue>0x0004</resetValue>
          <fields>
            <field>
              <name>AUTOWS</name>
              <description>Auto Wait State Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSPEN</name>
              <description>Suspend Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WMODE</name>
              <description>Write Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>WMODESelect</name>
                <enumeratedValue>
                  <name>MAN</name>
                  <description>Manual Write</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADW</name>
                  <description>Automatic Double Word Write</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AQW</name>
                  <description>Automatic Quad Word</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AP</name>
                  <description>Automatic Page Write</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRM</name>
              <description>Power Reduction Mode during Sleep</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>PRMSelect</name>
                <enumeratedValue>
                  <name>SEMIAUTO</name>
                  <description>NVM block enters low-power mode when entering standby mode. NVM block enters low-power mode when SPRM command is issued. NVM block exits low-power mode upon first access.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FULLAUTO</name>
                  <description>NVM block enters low-power mode when entering standby mode. NVM block enters low-power mode when SPRM command is issued. NVM block exits low-power mode when system is not in standby mode.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MANUAL</name>
                  <description>NVM block does not enter low-power mode when entering standby mode. NVM block enters low-power mode when SPRM command is issued. NVM block exits low-power mode upon first access.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RWS</name>
              <description>NVM Read Wait States</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>AHBNS0</name>
              <description>Force AHB0 access to NONSEQ, burst transfers are continuously rearbitrated</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AHBNS1</name>
              <description>Force AHB1 access to NONSEQ, burst transfers are continuously rearbitrated</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CACHEDIS0</name>
              <description>AHB0 Cache Disable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CACHEDIS1</name>
              <description>AHB1 Cache Disable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control B</description>
          <addressOffset>0x04</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CMD</name>
              <description>Command</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <name>CMDSelect</name>
                <enumeratedValue>
                  <name>EP</name>
                  <description>Erase Page - Only supported in the USER and AUX pages.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>EB</name>
                  <description>Erase Block - Erases the block addressed by the ADDR register, not supported in the user page</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WP</name>
                  <description>Write Page - Writes the contents of the page buffer to the page addressed by the ADDR register, not supported in the user page</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WQW</name>
                  <description>Write Quad Word - Writes a 128-bit word at the location addressed by the ADDR register.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWRST</name>
                  <description>Software Reset - Power-Cycle the NVM memory and replay the device automatic calibration procedure and resets the module configuration registers</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LR</name>
                  <description>Lock Region - Locks the region containing the address location in the ADDR register.</description>
                  <value>0x11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UR</name>
                  <description>Unlock Region - Unlocks the region containing the address location in the ADDR register.</description>
                  <value>0x12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SPRM</name>
                  <description>Sets the power reduction mode.</description>
                  <value>0x13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CPRM</name>
                  <description>Clears the power reduction mode.</description>
                  <value>0x14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PBC</name>
                  <description>Page Buffer Clear - Clears the page buffer.</description>
                  <value>0x15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSB</name>
                  <description>Set Security Bit</description>
                  <value>0x16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BKSWRST</name>
                  <description>Bank swap and system reset, if SMEE is used also reallocate SMEE data into the opposite BANK</description>
                  <value>0x17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CELCK</name>
                  <description>Chip Erase Lock - DSU.CE command is not available</description>
                  <value>0x18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CEULCK</name>
                  <description>Chip Erase Unlock - DSU.CE command is available</description>
                  <value>0x19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SBPDIS</name>
                  <description>Sets STATUS.BPDIS, Boot loader protection is discarded until CBPDIS is issued or next start-up sequence</description>
                  <value>0x1a</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBPDIS</name>
                  <description>Clears STATUS.BPDIS, Boot loader protection is not discarded</description>
                  <value>0x1b</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASEES0</name>
                  <description>Activate SmartEEPROM Sector 0, deactivate Sector 1</description>
                  <value>0x30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ASEES1</name>
                  <description>Activate SmartEEPROM Sector 1, deactivate Sector 0</description>
                  <value>0x31</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEERALOC</name>
                  <description>Starts SmartEEPROM sector reallocation algorithm</description>
                  <value>0x32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SEEFLUSH</name>
                  <description>Flush SMEE data when in buffered mode</description>
                  <value>0x33</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSEE</name>
                  <description>Lock access to SmartEEPROM data from any mean</description>
                  <value>0x34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USEE</name>
                  <description>Unlock access to SmartEEPROM data</description>
                  <value>0x35</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LSEER</name>
                  <description>Lock access to the SmartEEPROM Register Address Space (above 64KB)</description>
                  <value>0x36</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>USEER</name>
                  <description>Unlock access to the SmartEEPROM Register Address Space (above 64KB)</description>
                  <value>0x37</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDEX</name>
              <description>Command Execution</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>write-only</access>
              <enumeratedValues>
                <name>CMDEXSelect</name>
                <enumeratedValue>
                  <name>KEY</name>
                  <description>Execution Key</description>
                  <value>0xa5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAM</name>
          <description>NVM Parameter</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00060000</resetValue>
          <fields>
            <field>
              <name>NVMP</name>
              <description>NVM Pages</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PSZ</name>
              <description>Page Size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>PSZSelect</name>
                <enumeratedValue>
                  <name>8</name>
                  <description>8 bytes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>16 bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>32 bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64</name>
                  <description>64 bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128</name>
                  <description>128 bytes</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256</name>
                  <description>256 bytes</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512</name>
                  <description>512 bytes</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024</name>
                  <description>1024 bytes</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SEE</name>
              <description>SmartEEPROM Supported</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x0C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>DONE</name>
              <description>Command Done Interrupt Clear</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADDRE</name>
              <description>Address Error</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PROGE</name>
              <description>Programming Error Interrupt Clear</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKE</name>
              <description>Lock Error Interrupt Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCSE</name>
              <description>ECC Single Error Interrupt Clear</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCDE</name>
              <description>ECC Dual Error Interrupt Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NVME</name>
              <description>NVM Error Interrupt Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSP</name>
              <description>Suspended Write Or Erase Interrupt Clear</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEESFULL</name>
              <description>Active SEES Full Interrupt Clear</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEESOVF</name>
              <description>Active SEES Overflow Interrupt Clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEEWRC</name>
              <description>SEE Write Completed Interrupt Clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x0E</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>DONE</name>
              <description>Command Done Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADDRE</name>
              <description>Address Error Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PROGE</name>
              <description>Programming Error Interrupt Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKE</name>
              <description>Lock Error Interrupt Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCSE</name>
              <description>ECC Single Error Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCDE</name>
              <description>ECC Dual Error Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NVME</name>
              <description>NVM Error Interrupt Enable</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSP</name>
              <description>Suspended Write Or Erase  Interrupt Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEESFULL</name>
              <description>Active SEES Full Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEESOVF</name>
              <description>Active SEES Overflow Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEEWRC</name>
              <description>SEE Write Completed Interrupt Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Status and Clear</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>DONE</name>
              <description>Command Done</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADDRE</name>
              <description>Address Error</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PROGE</name>
              <description>Programming Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LOCKE</name>
              <description>Lock Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ECCSE</name>
              <description>ECC Single Error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCDE</name>
              <description>ECC Dual Error</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NVME</name>
              <description>NVM Error</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SUSP</name>
              <description>Suspended Write Or Erase Operation</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEESFULL</name>
              <description>Active SEES Full</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEESOVF</name>
              <description>Active SEES Overflow</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SEEWRC</name>
              <description>SEE Write Completed</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
